snlkuharlocal/src/DataProcessors/ПересчетЦенВЗПС/ПересчетЦенВЗПС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПересчетЦенВЗПС</name>
</mdclass:DataProcessor>

snlkuharlocal/src/AccumulationRegisters/Партии/Партии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Партии</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>16</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесНетто</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>CatalogRef.Партии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ШтВКоробе</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Контракт</name>
    <type>
      <types>CatalogRef.КонтрактыСПроизводителем</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЛН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/AccumulationRegisters/ОстаткиТМЦ/ОстаткиТМЦ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиТМЦ</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КодОперации</name>
    <type>
      <types>EnumRef.КодыОперацийОстатки</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>CatalogRef.СтатьиЗатрат</types>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Оборот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДК</name>
    <type>
      <types>CatalogRef.ДисконтныеКарты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПунктДоставки</name>
    <type>
      <types>CatalogRef.ПунктыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ОборотБезСкидки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОборотУпр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОборотБезСкидкиУпр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Амортизация</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Акция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/Enums/СостояниеЗаказаПоставщику/СостояниеЗаказаПоставщику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостояниеЗаказаПоставщику</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>ПредварительныйЗаказ</name>
  </enumValues>
  <enumValues>
    <name>ПодтвержденныйЗаказ</name>
  </enumValues>
  <enumValues>
    <name>Ликвидирован</name>
  </enumValues>
  <enumValues>
    <name>ВПути</name>
  </enumValues>
  <enumValues>
    <name>Таможня</name>
    <comment>Растамаживается</comment>
  </enumValues>
  <enumValues>
    <name>Получен</name>
  </enumValues>
  <enumValues>
    <name>ВПроизводстве</name>
  </enumValues>
  <enumValues>
    <name>Произведен</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
  <enumValues>
    <name>ВПутиВРФ</name>
  </enumValues>
  <enumValues>
    <name>ГотовоКОтгрузке</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/DataProcessors/ПересчетЦенВЗПС/ObjectModule.bsl
Процедура Сформировать(ТаблицаПараметров = Неопределено) Экспорт
	
	ПараметрыСеанса.ОтключитьЖурнализациюЗаписи	=Истина;	
	//		ПараметрыСеанса.ОтключитьКонтрольДЗР		=Истина;
	ПараметрыСеанса.ОтключитьКонтрольРезервов	=Истина;
	
	Если Константы.ДатаРасчетнойПоследовательностиЦенЗаказовПоставщикам.Получить() >  Константы.ДатаЗапретаРедактирования.Получить() Тогда
		ДатаЗапрета = Константы.ДатаРасчетнойПоследовательностиЦенЗаказовПоставщикам.Получить();  
	Иначе
		ДатаЗапрета = КонецДня(Константы.ДатаЗапретаРедактирования.Получить())+1; 
	КонецЕсли;
	
	ЗаписатьВЛог("Обработка цен в ЗПС","Начало обработки. Проведение с : "+ДатаЗапрета,"Информация");
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЗаказПоставщику.Ссылка КАК Документ
	|ИЗ
	|	Документ.ЗаказПоставщику КАК ЗаказПоставщику
	|ГДЕ
	|	ЗаказПоставщику.Проведен
	|	И ЗаказПоставщику.СостояниеЗаказа <> &СостояниеЗаказа
	|	И ЗаказПоставщику.Машина = &ПустаяМашина
	|	И (НЕ ЗаказПоставщику.ЦеныПересчитаны)
	|	И ЗаказПоставщику.ОтгрузкаСТранзитногоСклада
	|	И ЗаказПоставщику.Дата >= &ДатаЗапрета
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗаказПоставщику.Ссылка.Дата
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("СостояниеЗаказа",Перечисления.СостояниеЗаказаПоставщику.Получен);
	// Запрос.УстановитьПараметр("ДатаЗапрета",Макс(КонецДня(Константы.ДатаРасчетнойПоследовательностиЦенЗаказовПоставщикам.Получить()),КонецДня(Константы.ДатаЗапретаРедактирования.Получить())));
	Запрос.УстановитьПараметр("ДатаЗапрета",ДатаЗапрета);
	Запрос.УстановитьПараметр("ПустаяМашина",Документы.Машина.ПустаяСсылка());
	СписокЗПС = Новый ТаблицаЗначений;
	СписокЗПС.Колонки.Добавить("Документ");
	Выборка = запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаЗПС = СписокЗПС.Добавить();
		СтрокаЗПС.Документ = Выборка.Документ;
		
	КонецЦикла;
	
	// СтрокаЗПС = СписокЗПС.Добавить();
	//СтрокаЗПС.Документ = Документы.ЗаказПоставщику.НайтиПоНомеру("RI1-000132",ТекущаяДата());
	// СтрокаЗПС = СписокЗПС.Добавить();
	//СтрокаЗПС.Документ = Документы.ЗаказПоставщику.НайтиПоНомеру("RI1-000159",ТекущаяДата());
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ    Различные
	|	Партии.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.Партии КАК Партии
	|ГДЕ
	|	Партии.Период >= &ДатаЗапрета
	|
	|УПОРЯДОЧИТЬ ПО
	|	Регистратор
	|АВТОУПОРЯДОЧИВАНИЕ";
	Запрос.УстановитьПараметр("ДатаЗапрета",ДатаЗапрета);
	
	Выборка = запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		#Если Клиент Тогда
			ОбработкаПрерыванияПользователя();
		#КонецЕсли
		Если СписокЗПС.найти(Выборка.Регистратор,"Документ") <> Неопределено Тогда
			ПересчитатьЦеныВЗПС(Выборка.Регистратор);
		Иначе
			//ДокОбъект = Выборка.Регистратор.ПолучитьОбъект();
			//ДокОбъект.записать(РежимЗаписиДокумента.Проведение);
			//нечаева 15,10,14 +++
			ДокОбъект = Выборка.Регистратор.ПолучитьОбъект();
			ВидДок=Выборка.Регистратор.Ссылка.Метаданные().Имя;
			Если ВидДок<>"КоррекцияРегистраПартии" Тогда
				
				ДокОбъект.записать(РежимЗаписиДокумента.Проведение);
				//кухарь 26.02.15 начало
				//на случай блокировок, чтобы не цеплять запросом уже отработанные документы
				Константы.ДатаРасчетнойПоследовательностиЦенЗаказовПоставщикам.Установить(Выборка.Регистратор.дата);
				//кухарь 26.02.15 конец
				
			КонецЕсли;
			//нечаева 15,10,14 ---

			
			
			
			
			//	ЗаписатьВЛог("Обработка цен в ЗПС","Проведен ЗПС "+ДокОбъект.Номер + " от "+ДокОбъект.Дата,"Информация");
			
						
			
		КонецЕсли;
	КонецЦикла;
	Константы.ДатаРасчетнойПоследовательностиЦенЗаказовПоставщикам.Установить(ТекущаяДата());
	ПараметрыСеанса.ОтключитьЖурнализациюЗаписи	=Ложь;	
	//	ПараметрыСеанса.ОтключитьКонтрольДЗР		=Ложь;
	ПараметрыСеанса.ОтключитьКонтрольРезервов	=Ложь;
	ЗаписатьВЛог("Обработка цен в ЗПС","Обработка успешно завершена","Информация");
	
КонецПроцедуры

Процедура ПересчитатьЦеныВЗПС(ЗПС)
	запрос = Новый Запрос;
	запрос.Текст="ВЫБРАТЬ
	|	ОстаткиТМЦОстатки.Номенклатура,
	|	СУММА(ОстаткиТМЦОстатки.СуммаОстаток) КАК СуммаОстаток,
	|	СУММА(ОстаткиТМЦОстатки.КоличествоОстаток) КАК КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.ОстаткиТМЦ.Остатки(
	|			&Момент,
	|			Склад = &ТранзСклад
	|				И Номенклатура В (&СписокНом)) КАК ОстаткиТМЦОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиТМЦОстатки.Номенклатура";
	ДокОбъект = ЗПС.ПолучитьОбъект();
	Запрос.УстановитьПараметр("СписокНом",ДокОбъект.Товары.ВыгрузитьКолонку("Номенклатура"));
	Запрос.УстановитьПараметр("ТранзСклад",ДокОбъект.ТранзитныйСклад);
	Запрос.УстановитьПараметр("Момент",новый граница(ДокОбъект.МоментВремени(),видграницы.Исключая));
	
	Тз=запрос.Выполнить().Выгрузить();
	
	для каждого стр из ДокОбъект.товары цикл
		ТекСтр=тз.Найти(стр.номенклатура,"Номенклатура");
		Если ТекСтр=НЕОПРЕДЕЛЕНО тогда
			//	 сообщить("Не найдена цена для "+стр.Номенклатура);
			продолжить;
		Конецесли;	 
		если текстр.Количествоостаток=0 тогда
			//	 сообщить("0 количестводля "+стр.Номенклатура);
			продолжить;
		Конецесли;	 
		
		Цена=текстр.Суммаостаток/текстр.Количествоостаток;
		стр.цена=Цена;
		стр.ЦенаБезСкидки=стр.Цена;
		стр.сумма=стр.количество*стр.цена;
		стр.Всего=стр.Сумма;
		//крохин начало 30.04.2013
		//расчетные цены тоже заполняем, иначе без машины в ЗПС они не пересчитываются
		//Катаев+ 07/11/14 При нулевом количестве и цена расчетная должна быть пустой
		//стр.РасчетнаяЦена =стр.цена;
		Если стр.Количество = 0 Тогда
			стр.РасчетнаяЦена =0;
		Иначе
			стр.РасчетнаяЦена =стр.цена;
		КонецЕсли;
		//Катаев- 07/11/14
		стр.РасчетнаяСумма = стр.Сумма;
		//крохин конец 30.04.2013
		стр.СтавкаНДС=стр.Номенклатура.Родитель.СтавкаНДС;
		стр.Заявка=стр.Количество;
		стр.ПодтвержденнаяЗаявка=стр.Количество;
		РассчитатьСуммуТабЧасти(стр, ДокОбъект);
		
	Конеццикла;
	ДокОбъект.ЦеныПересчитаны = Истина;
	ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
	ЗаписатьВЛог("Обработка цен в ЗПС","Пересчитаны цены в ЗПС "+ДокОбъект.Номер + " от "+ДокОбъект.Дата,"Информация");
	
	
КонецПроцедуры
